BKuljanin/STM32-I2C-IRQ-BARO-MAG-Driver/Src/i2c.c
#include "stm32f4xx.h"
#include "systick.h"
#include "i2c.h"

#define GPIOBEN (1U<<1)
#define I2C1EN (1U<<21)
#define CR1_PE (1U<<0)

//read function
#define SR2_BUSY (1U<<1)
#define CR1_START (1U<<8)
#define SR1_SB (1U<<0)
#define SR1_ADDR (1U<<1)
#define SR1_TXE (1U<<7)
#define CR1_ACK (1U<<10)
#define CR1_STOP (1U<<9)
#define SR1_RXNE (1U<<6)
#define SR1_BTF (1U<<2)

// bus error related registers
#define SR1_BERR    (1U<<8)   // Bus error
#define SR1_ARLO    (1U<<9)   // Arbitration lost
#define SR1_AF      (1U<<10)  // Acknowledge failure (NACK)
#define SR1_OVR     (1U<<11)  // Overrun/Underrun
#define SR1_PECERR  (1U<<12)  // PEC error (SMBus, usually ignore)
#define SR1_TIMEOUT (1U<<14)  // Timeout/Tlow error
#define SR1_SMBALERT (1U<<15) // SMBus alert (usually ignore)


#define I2C_100KHZ 80 //0B 0101 000 decimal = 80
#define SD_MODE_MAX_RISE_TIME 17 // various tools compute this value

// Timeout constants
#define I2C_FLAG_TIMEOUT_MS   5U
#define I2C_BUSY_TIMEOUT_MS   5U

// Helper functions
#define I2C_SR1_AF (1U<<10)
#define I2C_SR2_BUSY (1U<<1)

// Prototypes of helper functions
static i2c_status_t wait_flag_set_checked(volatile uint32_t *reg, uint32_t mask, uint32_t timeout_ms);
static i2c_status_t wait_flag_clear_checked(volatile uint32_t *reg, uint32_t mask, uint32_t timeout_ms);
static i2c_status_t wait_flag_set_or_nack_checked(volatile uint32_t *reg, uint32_t mask, uint32_t timeout_ms);
static i2c_status_t i2c_abort_and_reset(i2c_status_t reason);


void I2C1_init(void)
{

	// Enable clock access for GPIOB
	RCC->AHB1ENR |= GPIOBEN;

	// Configure SCL and SDA lines of I2C1
	// Datasheet p58 alternate function PB8 SCL, PB9 SDA
	GPIOB->MODER &=~(1U<<16);
	GPIOB->MODER |=(1U<<17);
	GPIOB->MODER &=~(1U<<18);
	GPIOB->MODER |=(1U<<19); // in mode register

	// Set output type PB8 and PB9 to open drain (required for i2c), ref manual p186, write 1 for open drain
	GPIOB->OTYPER |= (1U<<8); // OT 8 and OT9 for PB8 and PB9
	GPIOB->OTYPER |= (1U<<9);

	// Enable Pullup for PB8,PB9
	GPIOB->PUPDR |= (1U<<16); // PB8 bits 16,17
	GPIOB->PUPDR &=~ (1U<<17); // 01 pullup

	GPIOB->PUPDR |= (1U<<18);
	GPIOB->PUPDR &=~ (1U<<19);

	// set alternate function type
	GPIOB->AFR[1] &=~ (1U<<0);
	GPIOB->AFR[1] &=~ (1U<<1);
	GPIOB->AFR[1] |= (1U<<2);
	GPIOB->AFR[1] &=~ (1U<<3);

	GPIOB->AFR[1] &=~ (1U<<4);
	GPIOB->AFR[1] &=~ (1U<<5);
	GPIOB->AFR[1] |= (1U<<6);
	GPIOB->AFR[1] &=~ (1U<<7);

	GPIOB->OSPEEDR |= (3U<<16) | (3U<<18);  // Reference manual p187. PB8, PB9 high speed

	RCC->APB1ENR |= I2C1EN; // Enable clock access for I2C1, Reference manual p146 bit 21

	// Enter reset mode
	I2C1->CR1 |= (1U<<15); // Reference manual p763, when HIGH, I2C is in reset state

	// Exit reset mode
	I2C1->CR1 &= ~(1U<<15);

	/*Configure peripheral clock*/
	I2C1->CR2 = (1U<<4);// I2C bus frequency. Reference manual p765. 16MHz (10000 binary 5th bit position 5)
	//If clock is 1MHz simply write 1 since its all MHz, set bit 0 to 1; if 2Mhz write to bit 1 (boolean 2)

	I2C1->CR1 |= CR1_ACK;   // Default ACK enabled, will be cleared it for last bytes

	I2C1->CCR = I2C_100KHZ; //CCR bits 0-11 I2C clock. We want standard mode 100kHz, 16MHz/(2*80) = 100kHz

	I2C1->TRISE = SD_MODE_MAX_RISE_TIME;// Rise time, reference manual p772,773. The time it takes for the I²C signal (SDA or SCL) to go from LOW to HIGH

	// Enable event + error interrupts
	I2C1->CR2 |= (1U<<9) | (1U<<8) | (1U<<10); // Reference manual p765, 766: ITERR, ITEVT, ITBUF

	NVIC_SetPriority(I2C1_EV_IRQn, 1); // Event interrupt: SB, ADDR, TXE, RXNE, BTF, STOPF
	NVIC_EnableIRQ(I2C1_EV_IRQn);

	NVIC_SetPriority(I2C1_ER_IRQn, 0); // Higher priority than EV
	NVIC_EnableIRQ(I2C1_ER_IRQn); // Error interrupt: AF (acknowledge failure), BERR (bus error), ARLO (arbitration lost), OVR (overrun, underrun), TIMEOUT

	//Enable I2C
	I2C1->CR1 |= CR1_PE;
}

// Read byte funciton
// 3 arguments, 1st address of slave, 2nd , 3rd pointer where to store
i2c_status_t I2C1_byteRead(char saddr, char maddr, char* data){

	volatile int tmp;

	/* First part of the message, writing to slave to set up internal register pointer
	 * start bit - slave address+W - slave memory address*/

	// Checking I2C busy flag
	if (wait_flag_clear_checked(&I2C1->SR2, SR2_BUSY, I2C_BUSY_TIMEOUT_MS) != I2C_OK) // Make sure the bus is not busy, check busy flag
	    return I2C_ERR_TIMEOUT; // These are all simple while(!())... functions but timeout and recover are built on, look at the bottom

	// Generating start condition
	I2C1->CR1 |= CR1_START; // Once its not busy, generate start condition, set start bit in CR1. Bit 8 start bit Reference manual p763

	// Wait until start bit set
	if (wait_flag_set_checked(&I2C1->SR1, SR1_SB, I2C_FLAG_TIMEOUT_MS) != I2C_OK) // Reference manual p767-770 SB start bit 0; 1: start condition generated
	    return I2C_ERR_TIMEOUT;

	// Transmit slave address + write
	I2C1->DR = saddr <<1; // Reference manual p767. This moves it into bits [7:1] and clears bit 0. R/W 0 = WRITE. So we type slave address, shift one left and that way bit 0 is 0 which is write

	// Wait until address flag is set
	if (wait_flag_set_or_nack_checked(&I2C1->SR1, SR1_ADDR, I2C_FLAG_TIMEOUT_MS) != I2C_OK)  // Wait until the slave ACKs the address
	    return I2C_ERR_TIMEOUT;

	// Clear address flag, clear it after the loop
	tmp = I2C1->SR1;
	tmp = I2C1->SR2; // Clear by reading SR First SR1 then SR2 according to reference manual p770

	// Now we can send memory address, send to data register
	I2C1->DR = maddr;

	// Wait until data register empty, check TXE flag
	//while(!(I2C1->SR1 & SR1_TXE)){} // Reference manual p769 bit 7.
	// Wait until the transmit data register is empty, indicating the previous byte has been loaded into the shift register and the next byte can be written
	// while(!(I2C1->SR1 & SR1_BTF)) {} Possibly include this line instead, which is byte transfer finished (unlike TXE which is only DR empty, but byte might be on bus)
	if (wait_flag_set_or_nack_checked(&I2C1->SR1, SR1_TXE, I2C_FLAG_TIMEOUT_MS) != I2C_OK)
	    return I2C_ERR_TIMEOUT;

	/* Second part of the message, reading from slave starts
	 * repeated start bit - slave address+R - reading data from slave*/

	// Generate another start condition - restart condition, same line as above
	I2C1->CR1 |= CR1_START; // Reference manual p764

	// Wait until start bit set
	if (wait_flag_set_checked(&I2C1->SR1, SR1_SB, I2C_FLAG_TIMEOUT_MS) != I2C_OK) // Reference manual p767-770 SB start bit 0; 1: start condition generated
		    return I2C_ERR_TIMEOUT;

	// Transmit slave address + read
	I2C1->DR = saddr <<1 | 1; // Shift slave address and sets bit 0 which is read

	// Wait until address flag is set
	if (wait_flag_set_or_nack_checked(&I2C1->SR1, SR1_ADDR, I2C_FLAG_TIMEOUT_MS) != I2C_OK)  // Wait until the slave ACKs the address
		    return I2C_ERR_TIMEOUT;

	// Disable acknowledge
	I2C1->CR1 &=~ CR1_ACK; // In the read, the master controls ACK, and thats why ACK is cleared here (on top it wasnt cleared since in write slave ACKs)
	// Preconfigures the MCU (master) to send a NACK after the next received data byte, indicating that no further bytes are requested.
	// This is required for a single byte read, because in I2C READ, the master uses NACK to tell the slave to stop transmitting, and STOP only terminates the bus afterward.
	// On the other side, ACK means keep sending data

