BKuljanin/STM32-I2C-IRQ-BARO-MAG-Driver/Src/i2c.c
	// Clear address flag by reading SR
	tmp = I2C1->SR1;
	tmp = I2C1->SR2;

	// Generate stop after data received
	I2C1->CR1 |= CR1_STOP; // Reference manual p764

	// Data register not empty
	if (wait_flag_set_or_nack_checked(&I2C1->SR1, SR1_RXNE, I2C_FLAG_TIMEOUT_MS) != I2C_OK)
	    return I2C_ERR_TIMEOUT; // Wait until one data byte has been received from the slave and is ready to be read

	*data++ = I2C1->DR; // Store received I2C byte in buffer and increment pointer. Will be useful for burst read

	return I2C_OK;
}


i2c_status_t I2C1_burstRead(char saddr, char maddr, int n, char* data)
{
	// n number of bytes to read
	// See the function above for detailed comments

	volatile int tmp;

	/* First part of the message, writing to slave to set up internal register pointer
	 * start bit - slave address+W - slave memory address*/

	// Checking I2C busy flag
	if (wait_flag_clear_checked(&I2C1->SR2, SR2_BUSY, I2C_BUSY_TIMEOUT_MS) != I2C_OK) // Make sure the bus is not busy, check busy flag
	    return I2C_ERR_TIMEOUT;

	// Generating start condition
	I2C1->CR1 |= CR1_START; // once its not busy, generate start condition, set start bit in cr1. bit 8 start bit p763

	// Wait until start bit set
	if (wait_flag_set_checked(&I2C1->SR1, SR1_SB, I2C_FLAG_TIMEOUT_MS) != I2C_OK) // Reference manual p767-770 SB start bit 0; 1: start condition generated
		    return I2C_ERR_TIMEOUT;

	// transmit slave address + write
	I2C1->DR = saddr <<1; // ref man p767. This moves it into bits [7:1] and clears bit 0. R/W 0 = WRITE. So we type slave address, shift one left and that way bit 0 is 0 which is write

	// Transmit slave address + write
	if (wait_flag_set_or_nack_checked(&I2C1->SR1, SR1_ADDR, I2C_FLAG_TIMEOUT_MS) != I2C_OK)  // Wait until the slave ACKs the address
	    return I2C_ERR_TIMEOUT;

	// Clear address flag
	tmp = I2C1->SR1;
	tmp = I2C1->SR2;

	// Wait until data register empty, check TXE flag
	if (wait_flag_set_or_nack_checked(&I2C1->SR1, SR1_TXE, I2C_FLAG_TIMEOUT_MS) != I2C_OK)
	    return I2C_ERR_TIMEOUT;

	// Now we can send memory address, send to data register
	I2C1->DR = maddr;

	if (wait_flag_set_or_nack_checked(&I2C1->SR1, SR1_TXE, I2C_FLAG_TIMEOUT_MS) != I2C_OK)
	    return I2C_ERR_TIMEOUT;

	/* Second part of the message, reading from slave starts
	 * repeated start bit - slave address+R - reading data from slave*/

	// Generate another start condition - restart condition, same line as above
	I2C1->CR1 |= CR1_START;

	// Wait until start bit set
	if (wait_flag_set_checked(&I2C1->SR1, SR1_SB, I2C_FLAG_TIMEOUT_MS) != I2C_OK) // Reference manual p767-770 SB start bit 0; 1: start condition generated
			    return I2C_ERR_TIMEOUT;

	// Transmit slave address + read
	I2C1->DR = saddr <<1 | 1;

	// Wait until address flag is set
	if (wait_flag_set_or_nack_checked(&I2C1->SR1, SR1_ADDR, I2C_FLAG_TIMEOUT_MS) != I2C_OK)  // Wait until the slave ACKs the address
	    return I2C_ERR_TIMEOUT;

	// Clear address flag, clear it after the loop. Clear by reading SR
	tmp = I2C1->SR1;
	tmp = I2C1->SR2;

	// Enable acknowledge
	I2C1->CR1 |= CR1_ACK; // Enable ACK so the master acknowledges each received byte, indicating that more data is requested from the slave (unlike NACK in previous function where we wanted 1 byte)

	while(n>0U)
	{
		// If one byte remains
		if(n==1U){
			// Disable acknowledge, on next byte received send NACK indicating end of burst read (no more data to be read)
			I2C1->CR1 &=~ CR1_ACK;

			// Generate stop condition to terminate the I2C transaction after the last byte
			I2C1->CR1 |= CR1_STOP;

			// Data register not empty
			if (wait_flag_set_or_nack_checked(&I2C1->SR1, SR1_RXNE, I2C_FLAG_TIMEOUT_MS) != I2C_OK)
			    return I2C_ERR_TIMEOUT; // Wait until data byte received from slave

			// Store received I2C byte in buffer and increment pointer
			*data++ = I2C1->DR; // data is the pointer to the vector buffer
			// 1) Store the byte into the location pointed to by data
			// 2) Increment the pointer data to point to the next buffer position

			/* Write the received byte to the current buffer element
			buf[0], then buf[1], then buf[2], ...
			Increment the pointer
			data now points to the next element in data vector */

			break;
		}
		else // More than 1 byte remaining to read
		{
			// Data register not empty
			if (wait_flag_set_or_nack_checked(&I2C1->SR1, SR1_RXNE, I2C_FLAG_TIMEOUT_MS) != I2C_OK)
			    return I2C_ERR_TIMEOUT;

			// Read data from DR
			(*data++) = I2C1->DR; // See above

			// Update the number of bytes left to read
			n--;
		}

	}
	return I2C_OK;
}

i2c_status_t I2C1_burstWrite(char saddr, char maddr, int n, char* data){
// Slave address, memory address, number of bytes to write, pointer data
	volatile int tmp;

	// Wait until bus not busy
	if (wait_flag_clear_checked(&I2C1->SR2, SR2_BUSY, I2C_BUSY_TIMEOUT_MS) != I2C_OK) // Make sure the bus is not busy, check busy flag
	    return I2C_ERR_TIMEOUT;

	// Generate start condition
	I2C1->CR1 |= CR1_START;

	// Waiting start condition
	if (wait_flag_set_checked(&I2C1->SR1, SR1_SB, I2C_FLAG_TIMEOUT_MS) != I2C_OK) // Reference manual p767-770 SB start bit 0; 1: start condition generated
		    return I2C_ERR_TIMEOUT;

	// Transmit slave address + write
	I2C1->DR = saddr <<1;

	// Wait until address flag is set
	if (wait_flag_set_or_nack_checked(&I2C1->SR1, SR1_ADDR, I2C_FLAG_TIMEOUT_MS) != I2C_OK)  // Wait until the slave ACKs the address
		    return I2C_ERR_TIMEOUT;

	// Clear address flag
	tmp = I2C1->SR1;
	tmp = I2C1->SR2;

	// Wait until data register empty, check TXE flag
	if (wait_flag_set_or_nack_checked(&I2C1->SR1, SR1_TXE, I2C_FLAG_TIMEOUT_MS) != I2C_OK)
		    return I2C_ERR_TIMEOUT;

	// Now we can send memory address to data register
	I2C1->DR = maddr;

	// Now we can write in for loop
	for (int i =0;i<n;i++){

		// Wait until data register is ready
		if (wait_flag_set_or_nack_checked(&I2C1->SR1, SR1_TXE, I2C_FLAG_TIMEOUT_MS) != I2C_OK)
			    return I2C_ERR_TIMEOUT; // Wait until the transmit data register is empty so the next byte can be written

		// Writing data to DR
		I2C1->DR = *data++; // Write the current buffer byte to DR and move the data pointer to the next element

