BKuljanin/STM32-I2C-IRQ-BARO-MAG-Driver/Src/i2c.c
	}

	// Wait until the byte transfer is finished
	if (wait_flag_set_or_nack_checked(&I2C1->SR1, SR1_BTF, I2C_FLAG_TIMEOUT_MS) != I2C_OK)
	    return I2C_ERR_TIMEOUT;
 // BTF set, indicates the data byte has been transmitted and the shift register and DR are both empty
	// Reference manual p770 but 2 byte transfer finished, waiting. 1: data byte transfer succeeded

	// Generate stop condition
	I2C1->CR1 |= CR1_STOP; // Generate stop after data received to terminate the I2C transaction after the last byte

	return I2C_OK;
}



/* Handling timeouts, re-enabling bus, implementing helper function */

// Elapsed time helper function
static inline uint32_t elapsed_ms(uint32_t start)
{
    return (uint32_t)(millis() - start);
}

// Wait for flag set
static i2c_status_t wait_flag_set(volatile uint32_t *reg, uint32_t mask, uint32_t timeout_ms)
{
    uint32_t start = millis(); // Obtain current time

    while (((*reg) & mask) == 0U) { // Counts while register value equals mask value. Stops when reg = mask
        if (elapsed_ms(start) >= timeout_ms) // Checking for timeout
            return I2C_ERR_TIMEOUT;
    }
    return I2C_OK;
}

// Wait for flag clear
static i2c_status_t wait_flag_clear(volatile uint32_t *reg, uint32_t mask, uint32_t timeout_ms)
{
    uint32_t start = millis(); // Obtain current time

    while (((*reg) & mask) != 0U) { // Counts while register value doesnt equal mask value. Stops when reg != mask
        if (elapsed_ms(start) >= timeout_ms) // Checking for timeout
            return I2C_ERR_TIMEOUT;
    }
    return I2C_OK;
}

// Wait for flag or detect NACK
static i2c_status_t wait_flag_set_or_nack(volatile uint32_t *reg, uint32_t mask, uint32_t timeout_ms)
{
    uint32_t start = millis();

    while (((*reg) & mask) == 0U) {

        if (I2C1->SR1 & I2C_SR1_AF) {   // NACK. Acknowledge failure, reference manual p768
            I2C1->SR1 &= ~I2C_SR1_AF;  // Clear AF, unblocks the peripheral. So clearing AF is mandatory to: allow STOP to complete, allow a new START, prevent permanent BUSY state
            return I2C_ERR_NACK;
        }

        if (elapsed_ms(start) >= timeout_ms)
            return I2C_ERR_TIMEOUT;
    }
    return I2C_OK;
}

// Abort plus peripheral reset
static i2c_status_t i2c_abort_and_reset(i2c_status_t reason)
{
    // Generate STOP
    I2C1->CR1 |= CR1_STOP;

    // Clear NACK flag if set
    if (I2C1->SR1 & I2C_SR1_AF)
        I2C1->SR1 &= ~I2C_SR1_AF;

    // Disable I2C
    I2C1->CR1 &= ~CR1_PE;

    // Small delay to let bus settle
    uint32_t start = millis();
    while (elapsed_ms(start) < 1U) {}

    // Re-enable peripheral
    I2C1->CR1 |= CR1_PE;

    // Check BUSY cleared
    if (wait_flag_clear(&I2C1->SR2, I2C_SR2_BUSY, I2C_BUSY_TIMEOUT_MS) != I2C_OK)
    {
        return I2C_ERR_RECOVERY;
    }

    return reason;
}

// I2C abort and reset if needed
static i2c_status_t wait_flag_set_checked(volatile uint32_t *reg,
                                         uint32_t mask,
                                         uint32_t timeout_ms)
{
    i2c_status_t st = wait_flag_set(reg, mask, timeout_ms);

    if (st != I2C_OK)
        return i2c_abort_and_reset(st);

    return I2C_OK;
}

static i2c_status_t wait_flag_clear_checked(volatile uint32_t *reg,
                                           uint32_t mask,
                                           uint32_t timeout_ms)
{
    i2c_status_t st = wait_flag_clear(reg, mask, timeout_ms);

    if (st != I2C_OK)
        return i2c_abort_and_reset(st);

    return I2C_OK;
}

static i2c_status_t wait_flag_set_or_nack_checked(volatile uint32_t *reg,
                                                 uint32_t mask,
                                                 uint32_t timeout_ms)
{
    i2c_status_t st = wait_flag_set_or_nack(reg, mask, timeout_ms);

    if (st != I2C_OK)
        return i2c_abort_and_reset(st);

    return I2C_OK;
}


// Handling interrupts
void I2C1_EV_IRQHandler(void)
{
    uint32_t sr1 = I2C1->SR1;

    /* 1. Start condition set */

    // START sent - send address
    if (sr1 & SR1_SB) {
    	 if (g.st == I2C_ST_START) { // Start bit expected
    	            g.addr_is_read = 0;
    	            I2C1->DR = g.saddr <<1; // Reference manual p767. This moves it into bits [7:1] and clears bit 0. R/W 0 = WRITE. So we type slave address, shift one left and that way bit 0 is 0 which is write
    	            //I2C1->DR = (uint8_t)(g.addr7 << 1);       // SLA+W
    	            g.st = I2C_ST_ADDR;
    	        } else if (g.st == I2C_ST_RESTART) { // Repeated start bit expected
    	            g.addr_is_read = 1;
    	            I2C1->DR = saddr <<1 | 1;  // Shift slave address and sets bit 0 which is read
    	            g.st = I2C_ST_ADDR;
    	        }
    	        return;
    }

    /* 2. Address sent and ACKed - ADDR */

    if (sr1 & SR1_ADDR) {
        volatile uint32_t tmp;
        tmp = I2C1->SR1;
        tmp = I2C1->SR2;
        (void)tmp; // Just to avoid compiler complaining about not using tmp

        if (g.addr_is_read == 0) {
            // We are in SLA+W phase: next send register address
            g.st = I2C_ST_SEND_REG;
        } else {
            // We are in SLA+R phase: configure ACK/NACK sequence based on rx_len
            if (g.rx_len == 1) {
                I2C1->CR1 &= ~CR1_ACK;  // NACK after 1 byte if there is only 1 byte remaining in transfer
                I2C1->CR1 |= CR1_STOP;  // STOP immediately after clearing ADDR
            }
            /*else if (g.rx_len == 2) {
                I2C1->CR1 |= CR1_POS;
                I2C1->CR1 &= ~CR1_ACK;  // NACK on the last two sequence
                // STOP will be set when BTF happens
            }*/
            else {
                I2C1->CR1 |= CR1_ACK;
                //I2C1->CR1 &= ~CR1_POS;
            }
            g.st = I2C_ST_RX;
        }
        return;
    }


    /* 3. TXR: DR empty, ready to write */

    if (sr1 & SR1_TXE) { // Previous byte moved from DR to shift register, ready to write
        if (g.st == I2C_ST_SEND_REG) { // Expected to send slave register address
            I2C1->DR = g.maddr;

            if (g.op == I2C_OP_READ_REGS) { // This operation is a register read
            // sequence is: START - SLAVE ADDR+W - SLAVE REG ADDR+R - REPEATED START - SLAVE ADDR+R - read bytes

                g.st = I2C_ST_RESTART;   // Update state to indicate that the next START generated is the repeated start phase

                I2C1->CR1 |= CR1_START; // During read arms the hardware to generate a repeated START only after the current byte transfer is finished safely.
            	}
            } else { // This operation is a register write

                g.st = I2C_ST_TX; // We are still in the write phase so we issue START
            }
            return;
        }


    /* 4. RXNE: data received */

    if (sr1 & SR1_RXNE) {
            if (g.st == I2C_ST_RX) {
                // For rx_len==1, RXNE is the final byte
                g.rx[g.rx_i++] = (uint8_t)I2C1->DR;

                if (g.rx_i >= g.rx_len) { // Reached last byte
                    i2c1_finish(I2C_OK, false); // STOP already sent in len==1 case; harmless if not
                }
                return;
            }
        }


    // 5) BTF: byte transfer finished (important for N=2 and last-3 handling)
        if (sr1 & SR1_BTF) {
            if (g.st == I2C_ST_RX) {
                uint16_t remaining = (uint16_t)(g.rx_len - g.rx_i);

